package exam;

public class Example08 {
	public static void main(String[] args) {
		/*
		 * 연산자(0perator)
		 * 프로그램에서 데이터를 처리하여 결과를 산출하는 것을 연산(0pertation)이라고 한다
		 * - 연산에 사용되는 표기나 기호를 연산자
		 * - 연산된느 데이터는 피연산자 라고 한다
		 * 
		 * a + b = c
		 * +, = => 연산자
		 * a + b => 항 피연산자
		 * 
		 * 단항연산자 : 피연산자 개수가 1개인 연산자
		 * 이항연산자 : 피연산자 개수가 2개인 연산자
		 * 삼항연산자 : 피연산자 개수가 3개인 연산자
		 * 
		 * 최우선 연산자
		 * 단항 연산자
		 * 산술 연산자
		 * 쉬프트 연산자
		 * 관계 연산자
		 * 논리 연산자
		 * 삼항 연산자
		 * 대입 연산자
		 * 
		 */
	}
}
